InThesisMachine/7nodes/SingleDocumentEntry07.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
   <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsa:To soapenv:mustUnderstand="true">http://127.0.0.1:6969/</wsa:To>
      <wsa:MessageID soapenv:mustUnderstand="true">urn:uuid:2311B77C122650C7B91554413514373</wsa:MessageID>
      <wsa:Action soapenv:mustUnderstand="true">urn:ihe:iti:2007:RegisterDocumentSet-b</wsa:Action>
   </soapenv:Header>
   <soapenv:Body>
      <lcm:SubmitObjectsRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0">
         <rim:RegistryObjectList xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
            <rim:ExtrinsicObject id="Document07" mimeType="text/plain" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1" status="urn:oasis:names:tc:ebxml-regrep:StatusType:Approved">
               <rim:Slot name="size">
                  <rim:ValueList>
                     <rim:Value>4</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Slot name="repositoryUniqueId">
                  <rim:ValueList>
                     <rim:Value>1.19.6.24.115.42.1</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Slot name="hash">
                  <rim:ValueList>
                     <rim:Value>2ea5f1f52a743115d722db1f4a3cc8c4c738b476</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Slot name="creationTime">
                  <rim:ValueList>
                     <rim:Value>20070403</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Slot name="languageCode">
                  <rim:ValueList>
                     <rim:Value>en-us</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Slot name="serviceStartTime">
                  <rim:ValueList>
                     <rim:Value>200704030900</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Slot name="serviceStopTime">
                  <rim:ValueList>
                     <rim:Value>200704031000</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Slot name="sourcePatientId">
                  <rim:ValueList>
                     <rim:Value>9926a4bf6^^^&amp;1.3.4.5&amp;ISO</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Slot name="sourcePatientInfo">
                  <rim:ValueList>
                     <rim:Value>PID-3|pid1^^^&amp;1.2.3&amp;ISO</rim:Value>
                     <rim:Value>PID-5|Kaiya^Zamora^^^</rim:Value>
                     <rim:Value>PID-7|19560527</rim:Value>
                     <rim:Value>PID-8|F</rim:Value>
                     <rim:Value>PID-11|1269 Hall Street^^North Las Vegas^NV^89030^USA</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Name>
                  <rim:LocalizedString value="DocG"></rim:LocalizedString>
               </rim:Name>
               <rim:Description></rim:Description>
               <rim:Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="Document07" nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_1">
                  <rim:Slot name="authorPerson">
                     <rim:ValueList>
                        <rim:Value>^Mujtaba^Palacios^^^</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Slot name="authorInstitution">
                     <rim:ValueList>
                        <rim:Value>Nevada Hospital</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Slot name="authorRole">
                     <rim:ValueList>
                        <rim:Value>Attending</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Slot name="authorSpecialty">
                     <rim:ValueList>
                        <rim:Value>Physiology</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="Document07" nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_2">
                  <rim:Slot name="authorPerson">
                     <rim:ValueList>
                        <rim:Value>^Jolie^Parker^^^</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Slot name="authorInstitution">
                     <rim:ValueList>
                        <rim:Value>Nevada Hospital</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Slot name="authorRole">
                     <rim:ValueList>
                        <rim:Value>Primary Physiologist</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Slot name="authorSpecialty">
                     <rim:ValueList>
                        <rim:Value>Physiology</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="Document07" nodeRepresentation="PLANS" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_3">
                  <rim:Slot name="codingScheme">
                     <rim:ValueList>
                        <rim:Value>1.3.6.1.4.1.19376.1.2.6.1</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                     <rim:LocalizedString value="Treatment Plan or Protocol"></rim:LocalizedString>
                  </rim:Name>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="Document07" nodeRepresentation="R" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_4">
                  <rim:Slot name="codingScheme">
                     <rim:ValueList>
                        <rim:Value>2.16.840.1.113883.5.25</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                     <rim:LocalizedString value="Restricted"></rim:LocalizedString>
                  </rim:Name>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="Document07" nodeRepresentation="urn:ihe:iti:bppc:2007" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_5">
                  <rim:Slot name="codingScheme">
                     <rim:ValueList>
                        <rim:Value>1.3.6.1.4.1.19376.1.2.3</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                     <rim:LocalizedString value="urn:ihe:iti:bppc:2007"></rim:LocalizedString>
                  </rim:Name>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="Document07" nodeRepresentation="66280005" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_6">
                  <rim:Slot name="codingScheme">
                     <rim:ValueList>
                        <rim:Value>2.16.840.1.113883.6.96</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                     <rim:LocalizedString value="Hospital-community"></rim:LocalizedString>
                  </rim:Name>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="Document07" nodeRepresentation="Practice-D" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_7">
                  <rim:Slot name="codingScheme">
                     <rim:ValueList>
                        <rim:Value>1.3.6.1.4.1.21367.2017.3</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                     <rim:LocalizedString value="General practice"></rim:LocalizedString>
                  </rim:Name>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4" classifiedObject="Document07" nodeRepresentation="urn:connectathon:bppc:foundational:policy" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_8">
                  <rim:Slot name="codingScheme">
                     <rim:ValueList>
                        <rim:Value>1.3.6.1.4.1.21367.2017.3</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                     <rim:LocalizedString value="Foundational Connectathon Read-Access Policy"></rim:LocalizedString>
                  </rim:Name>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4" classifiedObject="Document07" nodeRepresentation="urn:connectathon:policy:full-access" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_9">
                  <rim:Slot name="codingScheme">
                     <rim:ValueList>
                        <rim:Value>1.3.6.1.4.1.21367.2017.3</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                     <rim:LocalizedString value="FULL ACCESS TO ALL POLICY"></rim:LocalizedString>
                  </rim:Name>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="Document07" nodeRepresentation="11502-2" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_10">
                  <rim:Slot name="codingScheme">
                     <rim:ValueList>
                        <rim:Value>2.16.840.1.113883.6.1</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                     <rim:LocalizedString value="LABORATORY REPORT.TOTAL"></rim:LocalizedString>
                  </rim:Name>
               </rim:Classification>
               <rim:ExternalIdentifier identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" value="IHEBLUE-2736^^^&amp;1.3.6.1.4.1.41480.13.20.3000&amp;ISO" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_11" registryObject="Document07">
                  <rim:Name>
                     <rim:LocalizedString value="XDSDocumentEntry.patientId"></rim:LocalizedString>
                  </rim:Name>
               </rim:ExternalIdentifier>
               <rim:ExternalIdentifier identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" value="1.2.42.55694976369743.30" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_12" registryObject="Document07">
                  <rim:Name>
                     <rim:LocalizedString value="XDSDocumentEntry.uniqueId"></rim:LocalizedString>
                  </rim:Name>
               </rim:ExternalIdentifier>
            </rim:ExtrinsicObject>
            <rim:RegistryPackage id="SubmissionSet01" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage">
               <rim:Slot name="submissionTime">
                  <rim:ValueList>
                     <rim:Value>20041225235050</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Name>
                  <rim:LocalizedString value="Physical"></rim:LocalizedString>
               </rim:Name>
               <rim:Description>
                  <rim:LocalizedString value="Annual physical"></rim:LocalizedString>
               </rim:Description>
               <rim:Classification classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="SubmissionSet01" nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_13">
                  <rim:Slot name="authorPerson">
                     <rim:ValueList>
                        <rim:Value>^Jolie^Parker^^^</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Slot name="authorInstitution">
                     <rim:ValueList>
                        <rim:Value>Nevada Hospital</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Slot name="authorRole">
                     <rim:ValueList>
                        <rim:Value>Primary Physiologist</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Slot name="authorSpecialty">
                     <rim:ValueList>
                        <rim:Value>Physiology</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="SubmissionSet01" nodeRepresentation="394747008" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_14">
                  <rim:Slot name="codingScheme">
                     <rim:ValueList>
                        <rim:Value>2.16.840.1.113883.6.96</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                     <rim:LocalizedString value="Health Authority"></rim:LocalizedString>
                  </rim:Name>
               </rim:Classification>
               <rim:ExternalIdentifier identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" value="1.2.42.20190405034511.31" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_15" registryObject="SubmissionSet01">
                  <rim:Name>
                     <rim:LocalizedString value="XDSSubmissionSet.uniqueId"></rim:LocalizedString>
                  </rim:Name>
               </rim:ExternalIdentifier>
               <rim:ExternalIdentifier identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" value="1.3.6.1.4.1.21367.4" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_16" registryObject="SubmissionSet01">
                  <rim:Name>
                     <rim:LocalizedString value="XDSSubmissionSet.sourceId"></rim:LocalizedString>
                  </rim:Name>
               </rim:ExternalIdentifier>
               <rim:ExternalIdentifier identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" value="IHEBLUE-2736^^^&amp;1.3.6.1.4.1.21367.13.20.3000&amp;ISO" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_17" registryObject="SubmissionSet01">
                  <rim:Name>
                     <rim:LocalizedString value="XDSSubmissionSet.patientId"></rim:LocalizedString>
                  </rim:Name>
               </rim:ExternalIdentifier>
            </rim:RegistryPackage>
            <rim:Classification classifiedObject="SubmissionSet01" classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" id="ID_1507585920_1" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">   
            </rim:Classification>
            <rim:Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" sourceObject="SubmissionSet01" targetObject="Document07" id="ID_1507585920_2" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Association">
               <rim:Slot name="SubmissionSetStatus">
                  <rim:ValueList>
                     <rim:Value>Original</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
            </rim:Association>
         </rim:RegistryObjectList>
      </lcm:SubmitObjectsRequest>
   </soapenv:Body>
</soapenv:Envelope>


